using System;
using System.Collections.Generic;
using System.Text;

namespace TextUpsideDown
{
    class Translate
    {
        public static string InvertedText(string text)
        {
            if (text == null) return "";
            Dictionary<string, string> InvertedSymbols = new Dictionary<string, string>()
            {
                // Цифры
                { "0", "0"},
                { "1", "1"},
                { "2", "↊"},
                { "3", "Ԑ"},
                { "4", "4"},
                { "5", "5"},
                { "6'", "9"},
                { "7", "7"},
                { "8", "8"},
                { "9", "6"},

                // Знаки
                { "!", "¡"},
                { "\"", "\""},
                { "#", "#"},
                { "$", "$"},
                { "%", "%"},
                { "&", "&"},
                { "\'", ","},
                { "(", ")"},
                { ")", "("},
                { "*", "*"},
                { "+", "+"},
                { ",", "‘"},
                { "-", "-"},
                { ".", "˙"},
                { "/", "/"},
                { ":", ":"},
                { ";", ";"},
                { "<", ">"},
                { "=", "="},
                { ">", "<"},
                { "?", "¿"},
                { "@", "@"},
                { "[", "]"},
                { "\\", "\\"},
                { "]", "["},
                { "^", "^"},
                { "_", "¯"},
                { "{", "}"},
                { "|", "|"},
                { "}", "{"},
                { "~", "~"},
                { "`", ","},

                // Заглавные английские буквы
                { "A", "∀"},
                { "B", "ʚ"},
                { "C", "ɔ"},
                { "D", "Ɑ"},
                { "E", "∃"},
                { "F", "Ⅎ"},
                { "G", "⅁"},
                { "H", "H"},
                { "I", "I"},
                { "J", "ɾ"},
                { "K", "Ʞ"},
                { "L", "Ꞁ"},
                { "M", "W"},
                { "N", "N"},
                { "O", "O"},
                { "P", "d"},
                { "Q", "ᕹ"},
                { "R", "ᴚ"},
                { "S", "S"},
                { "T", "⊥"},
                { "U", "∩"},
                { "V", "Ʌ"},
                { "W", "M"},
                { "X", "X"},
                { "Y", "⅄"},
                { "Z", "Z"},

                // Строчные английские буквы
                
                { "a", "ɐ"},
                { "b", "q"},
                { "c", "ɔ"},
                { "d", "p"},
                { "e", "ǝ"},
                { "f", "ɟ"},
                { "g", "б" },
                { "h", "ɥ" },
                { "i", "ı"},
                { "j", "ɾ"},
                { "k", "ʞ"},
                { "l", "l"},
                { "m", "ɯ"},
                { "n", "u"},
                { "o", "o"},
                { "p", "d"},
                { "q", "ᕹ"},
                { "r", "ɹ"},
                { "s", "s"},
                { "t", "ʇ"},
                { "u", "n"},
                { "v", "ʌ"},
                { "w", "ʍ"},
                { "x", "x"},
                { "y", "ʎ"},
                { "z", "z"},

                // Заглавные русские буквы
                { "А", "∀"},
                { "Б", "g"},
                { "В", "ʚ"},
                { "Г", "L"},
                { "Д", "6"},
                { "Е", "∃"},
                { "Ё", "∃"},
                { "Ж", "Ж"},
                { "З", "Ԑ"},
                { "И", "И"},
                { "Й", "И"},
                { "К", "Ʞ"},
                { "Л", "V"},
                { "М", "W"},
                { "Н", "Н"},
                { "О", "О"},
                { "П", "U"},
                { "Р", "d"},
                { "С", "ɔ"},
                { "Т", "⊥"},
                { "У", "ʎ"},
                { "Ф", "Ф"},
                { "Х", "Х"},
                { "Ц", "ц"},
                { "Ч", "Һ"},
                { "Ш", "m"},
                { "Щ", "m"},
                { "Ъ", "q"},
                { "Ы", "ıq"},
                { "Ь", "ꟼ"},
                { "Э", "є"},
                { "Ю", "ю"},
                { "Я", "ʁ"},

                // Строчные русские буквы
                { "а", "ɐ"},
                { "б", "ƍ"},
                { "в", "ʚ"},
                { "г", "ɹ"},
                { "д", "ɓ"},
                { "е", "ǝ"},
                { "ё", "ǝ"},
                { "ж", "ж"},
                { "з", "ε"},
                { "и", "и"},
                { "й", "и"},
                { "к", "ʞ"},
                { "л", "v"},
                { "м", "w"},
                { "н", "н"},
                { "о", "о"},
                { "п", "u"},
                { "р", "d"},
                { "с", "ɔ"},
                { "т", "⊥"},
                { "у", "ʎ"},
                { "ф", "ф"},
                { "х", "х"},
                { "ц", "ǹ"},
                { "ч", "Һ"},
                { "ш", "m"},
                { "щ", "m"},
                { "ъ", "q"},
                { "ы", "ıq"},
                { "ь", "q"},
                { "э", "є"},
                { "ю", "oı"},
                { "я", "ʁ"},
            };
            string newText = "";

            for (int i = text.Length - 1; i >= 0; i--)
            {
                string symbol = text[i].ToString();
                if (InvertedSymbols.ContainsKey(symbol))
                    newText += InvertedSymbols[symbol];
                else
                    newText += symbol;
            }

            return newText;
        }
    }
}
